glcloud/keil_v5/ARM/PACK/.Web/NXP.MKL17Z4_DFP.pdsc
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKL17Z4" Cversion="1.0.0" condition="device.MKL17Z4_AND_component.lpuart_adapter_AND_component.serial_manager_uart_AND_device.MKL17Z4_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.lpuart_AND_driver.port_AND_driver.smc_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MKL17Z4_startup" Cversion="1.0.0" condition="device.MKL17Z4_AND_CMSIS_Include_core_cm0plus">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MKL17Z4.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MKL17Z4.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKL17Z128xxx4_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKL17Z128xxx4_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKL17Z256xxx4_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKL17Z256xxx4_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKL17Z128xxx4_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKL17Z128xxx4_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKL17Z256xxx4_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKL17Z256xxx4_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="MKL17Z4.h"/>
        <file category="header" attr="config" name="MKL17Z4_features.h"/>
        <file category="sourceC" attr="config" name="system_MKL17Z4.c"/>
        <file category="header" attr="config" name="system_MKL17Z4.h"/>
      </files>
    </component>
  </components>
</package>
